[Sankofa - Detect Brute Force]
search = index=* (sourcetype="WinEventLog:Security") EventCode=4625 | stats count by src_ip, Account_Name | where count > 10 | eval severity=2, title="Brute Force - ".Account_Name." from ".src_ip
dispatch.earliest_time = -15m
dispatch.latest_time = now
alert.track = 1
alert.severity = 3
enableSched = 1
cron_schedule = */5 * * * *
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
counttype = number of events
relation = greater than
quantity = 0

[Sankofa - Detect Lateral Movement]
search = index=* sourcetype="WinEventLog:Security" (EventCode=4648 OR EventCode=4624) Logon_Type=3 | stats count by Account_Name, Target_Server_Name | where count > 3
dispatch.earliest_time = -15m
dispatch.latest_time = now
alert.track = 1
alert.severity = 2
enableSched = 1
cron_schedule = */5 * * * *
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
counttype = number of events
relation = greater than
quantity = 0

[Sankofa - Detect LSASS Access]
search = index=* sourcetype="WinEventLog:Security" EventCode=4656 Object_Name="*lsass*"
dispatch.earliest_time = -15m
dispatch.latest_time = now
alert.track = 1
alert.severity = 1
enableSched = 1
cron_schedule = */2 * * * *
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
counttype = number of events
relation = greater than
quantity = 0

[Sankofa - Detect C2 Beacon]
search = index=* (sourcetype="firewall" OR sourcetype="pan:traffic") action=allowed dest_category=unknown | stats count, sum(bytes) as total_bytes by src, dest | where count > 5 AND total_bytes > 1000
dispatch.earliest_time = -30m
dispatch.latest_time = now
alert.track = 1
alert.severity = 2
enableSched = 1
cron_schedule = */10 * * * *
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
counttype = number of events
relation = greater than
quantity = 0
